Revit 2026 API

# FabricationPartStretchAndFit Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FabricationPartFitResult StretchAndFit(
	Document document,
	Connector stretchConnector,
	FabricationPartRouteEnd target,
	out ISet<ElementId> newPartIds
)
```
```vb
Public Shared Function StretchAndFit (
	document As Document,
	stretchConnector As Connector,
	target As FabricationPartRouteEnd,
	<OutAttribute> ByRef newPartIds As ISet(Of ElementId)
) As FabricationPartFitResult
```
```cpp
public:
static FabricationPartFitResult StretchAndFit(
	Document^ document,
	Connector^ stretchConnector,
	FabricationPartRouteEnd^ target,
	[OutAttribute] ISet<ElementId^>^% newPartIds
)
```
```fsharp
static member StretchAndFit :
        document : Document *
        stretchConnector : Connector *
        target : FabricationPartRouteEnd *
        newPartIds : ISet<ElementId> byref -> FabricationPartFitResult
```

#### Parameters

document Document

stretchConnector Connector

target FabricationPartRouteEnd

newPartIds ISetElementId

#### Return Value

FabricationPartFitResult

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace